SOAP/resources/catalog/Calculator_Envelope.txt

<?xml version="1.0" encoding="utf-8"?>
<!--Envelope that encapsulates the provided data: Operator, intA and intB specific to the arithmetic calculation request-->
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
    	<Operator xmlns="http://tempuri.org/">
     	 <intA xmlns="http://tempuri.org/">?</intA>
     	 <intB xmlns="http://tempuri.org/">?</intB>
    	</Operator>
  	</soap:Body>
</soap:Envelope>